In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
   'name':['george','pranjal','mayank','rajjwal','divya'],
   'marks':[99,95,98,96,84],
   'city':['prayahraj','mirzapur','allapur','daraganj','daraganj']
}

In [3]:
df=pd.DataFrame(dict1)

In [4]:
df = pd.DataFrame(dict1)

In [5]:
df.head()

      name  marks       city
0   george     99  prayahraj
1  pranjal     95   mirzapur
2   mayank     98    allapur
3  rajjwal     96   daraganj
4    divya     84   daraganj

In [6]:
df.head(2)

      name  marks       city
0   george     99  prayahraj
1  pranjal     95   mirzapur

In [7]:
df.to_csv("first.csv")

In [8]:
df.to_csv('second.csv', index = False)

In [9]:
df.tail(2)

      name  marks      city
3  rajjwal     96  daraganj
4    divya     84  daraganj

In [10]:
df.describe()

           marks
count   5.000000
mean   94.400000
std     6.024948
min    84.000000
25%    95.000000
50%    96.000000
75%    98.000000
max    99.000000

In [11]:
train = pd.read_csv("train.csv")

In [12]:
train

   train_no.  speed       city
0      12792     23  prayahraj
1      12342    343   mirzapur
2      23442     43    allapur
3      34323    433   daraganj
4      23442     86   daraganj

In [13]:
train["speed"]

0     23
1    343
2     43
3    433
4     86
Name: speed, dtype: int64

In [14]:
train["speed"][0]

23

In [15]:
train['speed'][0]=100

C:\Users\georg\AppData\Local\Temp\ipykernel_15380\2570865288.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train['speed'][0]=100

In [16]:
train

   train_no.  speed       city
0      12792    100  prayahraj
1      12342    343   mirzapur
2      23442     43    allapur
3      34323    433   daraganj
4      23442     86   daraganj

In [17]:
train.to_csv("csv2.csv")

In [18]:
train.to_csv('csv2.csv',index=False)

In [19]:
train.index=['one','two','three','four','five']

In [20]:
train

       train_no.  speed       city
one        12792    100  prayahraj
two        12342    343   mirzapur
three      23442     43    allapur
four       34323    433   daraganj
five       23442     86   daraganj

In [21]:
newdf = pd.DataFrame(np.random.rand(334,5), index = np.arange(334))

In [22]:
newdf

            0         1         2         3         4
0    0.128721  0.189492  0.044505  0.676876  0.493882
1    0.627472  0.972957  0.011458  0.885333  0.881150
2    0.692252  0.423431  0.288060  0.722904  0.182022
3    0.829972  0.562875  0.290180  0.572655  0.855907
4    0.918088  0.113285  0.902494  0.482764  0.444646
..        ...       ...       ...       ...       ...
329  0.839853  0.110830  0.920963  0.429229  0.762587
330  0.331214  0.540067  0.854674  0.944500  0.333686
331  0.629779  0.145410  0.499455  0.920587  0.287479
332  0.430849  0.779571  0.085808  0.252497  0.314222
333  0.084547  0.442346  0.218716  0.608214  0.023570

[334 rows x 5 columns]

In [23]:
type(newdf)
newdf.head()

          0         1         2         3         4
0  0.128721  0.189492  0.044505  0.676876  0.493882
1  0.627472  0.972957  0.011458  0.885333  0.881150
2  0.692252  0.423431  0.288060  0.722904  0.182022
3  0.829972  0.562875  0.290180  0.572655  0.855907
4  0.918088  0.113285  0.902494  0.482764  0.444646

In [24]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.491711    0.479042    0.535556    0.497950    0.476521
std      0.281430    0.283499    0.293743    0.281999    0.291179
min      0.000990    0.003771    0.001874    0.001275    0.000265
25%      0.260553    0.234997    0.284659    0.234135    0.215623
50%      0.464757    0.449314    0.537318    0.524091    0.458610
75%      0.732265    0.733514    0.795152    0.709075    0.732285
max      0.994327    0.993114    0.998138    0.999387    0.997532

In [25]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [26]:
newdf.head()

          0         1         2         3         4
0  0.128721  0.189492  0.044505  0.676876  0.493882
1  0.627472  0.972957  0.011458  0.885333  0.881150
2  0.692252  0.423431  0.288060  0.722904  0.182022
3  0.829972  0.562875  0.290180  0.572655  0.855907
4  0.918088  0.113285  0.902494  0.482764  0.444646

In [27]:
newdf.sort_index(axis = 0, ascending = False)

            0         1         2         3         4
333  0.084547  0.442346  0.218716  0.608214  0.023570
332  0.430849  0.779571  0.085808  0.252497  0.314222
331  0.629779  0.145410  0.499455  0.920587  0.287479
330  0.331214  0.540067  0.854674  0.944500  0.333686
329  0.839853  0.110830  0.920963  0.429229  0.762587
..        ...       ...       ...       ...       ...
4    0.918088  0.113285  0.902494  0.482764  0.444646
3    0.829972  0.562875  0.290180  0.572655  0.855907
2    0.692252  0.423431  0.288060  0.722904  0.182022
1    0.627472  0.972957  0.011458  0.885333  0.881150
0    0.128721  0.189492  0.044505  0.676876  0.493882

[334 rows x 5 columns]

In [28]:
newdf.head

<bound method NDFrame.head of             0         1         2         3         4
0    0.128721  0.189492  0.044505  0.676876  0.493882
1    0.627472  0.972957  0.011458  0.885333  0.881150
2    0.692252  0.423431  0.288060  0.722904  0.182022
3    0.829972  0.562875  0.290180  0.572655  0.855907
4    0.918088  0.113285  0.902494  0.482764  0.444646
..        ...       ...       ...       ...       ...
329  0.839853  0.110830  0.920963  0.429229  0.762587
330  0.331214  0.540067  0.854674  0.944500  0.333686
331  0.629779  0.145410  0.499455  0.920587  0.287479
332  0.430849  0.779571  0.085808  0.252497  0.314222
333  0.084547  0.442346  0.218716  0.608214  0.023570

[334 rows x 5 columns]>

In [29]:
newdf.head()

          0         1         2         3         4
0  0.128721  0.189492  0.044505  0.676876  0.493882
1  0.627472  0.972957  0.011458  0.885333  0.881150
2  0.692252  0.423431  0.288060  0.722904  0.182022
3  0.829972  0.562875  0.290180  0.572655  0.855907
4  0.918088  0.113285  0.902494  0.482764  0.444646

In [30]:
newdf2 = newdf

In [31]:
newdf2[0][0]= 222

In [32]:
newdf.head()

            0         1         2         3         4
0  222.000000  0.189492  0.044505  0.676876  0.493882
1    0.627472  0.972957  0.011458  0.885333  0.881150
2    0.692252  0.423431  0.288060  0.722904  0.182022
3    0.829972  0.562875  0.290180  0.572655  0.855907
4    0.918088  0.113285  0.902494  0.482764  0.444646

In [33]:
newdf.columns = list('ABCDE')

In [34]:
newdf.head()

            A         B         C         D         E
0  222.000000  0.189492  0.044505  0.676876  0.493882
1    0.627472  0.972957  0.011458  0.885333  0.881150
2    0.692252  0.423431  0.288060  0.722904  0.182022
3    0.829972  0.562875  0.290180  0.572655  0.855907
4    0.918088  0.113285  0.902494  0.482764  0.444646

In [35]:
newdf.loc[0,'A']= 443

In [36]:
newdf.head()

            A         B         C         D         E
0  443.000000  0.189492  0.044505  0.676876  0.493882
1    0.627472  0.972957  0.011458  0.885333  0.881150
2    0.692252  0.423431  0.288060  0.722904  0.182022
3    0.829972  0.562875  0.290180  0.572655  0.855907
4    0.918088  0.113285  0.902494  0.482764  0.444646

In [38]:
newdf.loc[[1,2,3],['C','D']]

          C         D
1  0.011458  0.885333
2  0.288060  0.722904
3  0.290180  0.572655

In [39]:
newdf.loc[:,['C','D']]

            C         D
0    0.044505  0.676876
1    0.011458  0.885333
2    0.288060  0.722904
3    0.290180  0.572655
4    0.902494  0.482764
..        ...       ...
329  0.920963  0.429229
330  0.854674  0.944500
331  0.499455  0.920587
332  0.085808  0.252497
333  0.218716  0.608214

[334 rows x 2 columns]

In [40]:
newdf.head()

            A         B         C         D         E
0  443.000000  0.189492  0.044505  0.676876  0.493882
1    0.627472  0.972957  0.011458  0.885333  0.881150
2    0.692252  0.423431  0.288060  0.722904  0.182022
3    0.829972  0.562875  0.290180  0.572655  0.855907
4    0.918088  0.113285  0.902494  0.482764  0.444646

In [41]:
newdf.loc[(newdf['A']>0.99)]

              A         B         C         D         E
0    443.000000  0.189492  0.044505  0.676876  0.493882
181    0.994327  0.559648  0.886672  0.057260  0.003600
324    0.991364  0.914942  0.250432  0.613660  0.162415

In [42]:
newdf.loc[(newdf['B']>0.7) & (newdf['B']>0.3)]

            A         B         C         D         E
1    0.627472  0.972957  0.011458  0.885333  0.881150
9    0.142112  0.765425  0.222500  0.415252  0.308707
13   0.455055  0.911893  0.769726  0.230183  0.889869
15   0.183093  0.786194  0.212258  0.419792  0.269318
17   0.532633  0.803221  0.198797  0.196487  0.281631
..        ...       ...       ...       ...       ...
321  0.599804  0.970605  0.618107  0.228819  0.997532
324  0.991364  0.914942  0.250432  0.613660  0.162415
325  0.589008  0.913841  0.323413  0.688665  0.969982
327  0.809199  0.788426  0.544535  0.406261  0.835251
332  0.430849  0.779571  0.085808  0.252497  0.314222

[87 rows x 5 columns]

In [43]:
newdf.drop('E', axis = 1)

              A         B         C         D
0    443.000000  0.189492  0.044505  0.676876
1      0.627472  0.972957  0.011458  0.885333
2      0.692252  0.423431  0.288060  0.722904
3      0.829972  0.562875  0.290180  0.572655
4      0.918088  0.113285  0.902494  0.482764
..          ...       ...       ...       ...
329    0.839853  0.110830  0.920963  0.429229
330    0.331214  0.540067  0.854674  0.944500
331    0.629779  0.145410  0.499455  0.920587
332    0.430849  0.779571  0.085808  0.252497
333    0.084547  0.442346  0.218716  0.608214

[334 rows x 4 columns]

In [44]:
newdf.loc[(newdf['A']>0.3)]

              A         B         C         D         E
0    443.000000  0.189492  0.044505  0.676876  0.493882
1      0.627472  0.972957  0.011458  0.885333  0.881150
2      0.692252  0.423431  0.288060  0.722904  0.182022
3      0.829972  0.562875  0.290180  0.572655  0.855907
4      0.918088  0.113285  0.902494  0.482764  0.444646
..          ...       ...       ...       ...       ...
327    0.809199  0.788426  0.544535  0.406261  0.835251
329    0.839853  0.110830  0.920963  0.429229  0.762587
330    0.331214  0.540067  0.854674  0.944500  0.333686
331    0.629779  0.145410  0.499455  0.920587  0.287479
332    0.430849  0.779571  0.085808  0.252497  0.314222

[239 rows x 5 columns]

In [45]:
newdf.iloc[1,3]

0.8853326941615569

In [46]:
newdf.iloc[[2,3,4,5],[2,3,4]]

          C         D         E
2  0.288060  0.722904  0.182022
3  0.290180  0.572655  0.855907
4  0.902494  0.482764  0.444646
5  0.100488  0.056536  0.387264

In [47]:
newdf.head()

            A         B         C         D         E
0  443.000000  0.189492  0.044505  0.676876  0.493882
1    0.627472  0.972957  0.011458  0.885333  0.881150
2    0.692252  0.423431  0.288060  0.722904  0.182022
3    0.829972  0.562875  0.290180  0.572655  0.855907
4    0.918088  0.113285  0.902494  0.482764  0.444646

In [48]:
newdf.drop(['A','B'],axis=1,inplace= True)

In [49]:
newdf.head()

          C         D         E
0  0.044505  0.676876  0.493882
1  0.011458  0.885333  0.881150
2  0.288060  0.722904  0.182022
3  0.290180  0.572655  0.855907
4  0.902494  0.482764  0.444646

In [50]:
newdf.sort_index(axis = 0, ascending= True, inplace = True)

In [51]:
newdf.head()

          C         D         E
0  0.044505  0.676876  0.493882
1  0.011458  0.885333  0.881150
2  0.288060  0.722904  0.182022
3  0.290180  0.572655  0.855907
4  0.902494  0.482764  0.444646

In [52]:
newdf.drop([0,2,4],axis = 0, inplace = True)

In [53]:
newdf.head()

          C         D         E
1  0.011458  0.885333  0.881150
3  0.290180  0.572655  0.855907
5  0.100488  0.056536  0.387264
6  0.922797  0.672191  0.041316
7  0.865288  0.195969  0.959753

In [54]:
newdf.reset_index()

     index         C         D         E
0        1  0.011458  0.885333  0.881150
1        3  0.290180  0.572655  0.855907
2        5  0.100488  0.056536  0.387264
3        6  0.922797  0.672191  0.041316
4        7  0.865288  0.195969  0.959753
..     ...       ...       ...       ...
326    329  0.920963  0.429229  0.762587
327    330  0.854674  0.944500  0.333686
328    331  0.499455  0.920587  0.287479
329    332  0.085808  0.252497  0.314222
330    333  0.218716  0.608214  0.023570

[331 rows x 4 columns]

In [64]:
newdf.reset_index(drop = True,inplace = True)

In [66]:
newdf.head(3)

   index         C         D         E
0      1  0.011458  0.885333  0.881150
1      3  0.290180  0.572655  0.855907
2      5  0.100488  0.056536  0.387264

In [67]:
newdf.head()

   index         C         D         E
0      1  0.011458  0.885333  0.881150
1      3  0.290180  0.572655  0.855907
2      5  0.100488  0.056536  0.387264
3      6  0.922797  0.672191  0.041316
4      7  0.865288  0.195969  0.959753

In [71]:
newdf.loc[:,['C']]=560

In [73]:
newdf.head()

   index      C         D         E   B
0      1  560.0  0.885333  0.881150  56
1      3  560.0  0.572655  0.855907  56
2      5  560.0  0.056536  0.387264  56
3      6  560.0  0.672191  0.041316  56
4      7  560.0  0.195969  0.959753  56

In [74]:
dp = pd.DataFrame({
    'brand': ['Yum Yum', 'Yum Yum', 'Indomie', 'Indomie', 'Indomie'],
    'style': ['cup', 'cup', 'cup', 'pack', 'pack'],
    'rating': [4, 4, 3.5, 15, 5]
})

In [75]:
dp.head()

     brand style  rating
0  Yum Yum   cup     4.0
1  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [77]:
dp.drop_duplicates()

     brand style  rating
0  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [82]:
newdf['E'].isnull()

0      True
1      True
2      True
3      True
4      True
       ...
326    True
327    True
328    True
329    True
330    True
Name: E, Length: 331, dtype: bool

In [80]:
newdf.loc[:,['E']]=None

In [81]:
newdf.head()

   index      C         D     E   B
0      1  560.0  0.885333  None  56
1      3  560.0  0.572655  None  56
2      5  560.0  0.056536  None  56
3      6  560.0  0.672191  None  56
4      7  560.0  0.195969  None  56

In [83]:
newdf['E'].isnull()

0      True
1      True
2      True
3      True
4      True
       ...
326    True
327    True
328    True
329    True
330    True
Name: E, Length: 331, dtype: bool

In [84]:
dp.head()

     brand style  rating
0  Yum Yum   cup     4.0
1  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [89]:
dp.dropna()

     brand style  rating
0  Yum Yum   cup     4.0
1  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [91]:
newdf.dropna(how = 'all')

     index      C         D     E   B
0        1  560.0  0.885333  None  56
1        3  560.0  0.572655  None  56
2        5  560.0  0.056536  None  56
3        6  560.0  0.672191  None  56
4        7  560.0  0.195969  None  56
..     ...    ...       ...   ...  ..
326    329  560.0  0.429229  None  56
327    330  560.0  0.944500  None  56
328    331  560.0  0.920587  None  56
329    332  560.0  0.252497  None  56
330    333  560.0  0.608214  None  56

[331 rows x 5 columns]

In [3]:
df = pd.DataFrame({
    'name' : ['Alfred','batman','Catwoman'],
    'toy':[np.nan, np.nan,np.nan],
    'born':[pd.NaT,pd.Timestamp('1940-04-25'),pd.NaT]
})

In [4]:
df.dropna(how = 'all',axis=1)

       name       born
0    Alfred        NaT
1    batman 1940-04-25
2  Catwoman        NaT

In [5]:
df.head()

       name  toy       born
0    Alfred  NaN        NaT
1    batman  NaN 1940-04-25
2  Catwoman  NaN        NaT

In [2]:
dm = pd.DataFrame({
    'name' : ['Alfred','batman','Alfred'],
    'toy':[np.nan, np.nan,np.nan],
    'born':[pd.NaT,pd.Timestamp('1940-04-25'),pd.NaT]
})

In [7]:
dm.head()

     name  toy       born
0  Alfred  NaN        NaT
1  batman  NaN 1940-04-25
2  Alfred  NaN        NaT

In [10]:
dm.drop_duplicates(subset = ["name"])

     name  toy       born
0  Alfred  NaN        NaT
1  batman  NaN 1940-04-25

In [20]:
dm.drop_duplicates(subset=["name"], keep = False)

     name  toy       born
1  batman  NaN 1940-04-25

In [3]:
dm.info

<bound method DataFrame.info of      name  toy       born
0  Alfred  NaN        NaT
1  batman  NaN 1940-04-25
2  Alfred  NaN        NaT>

In [4]:
df.isnull()

NameError: name 'df' is not defined

In [5]:
dm.isnull()

    name   toy   born
0  False  True   True
1  False  True  False
2  False  True   True

In [7]:
dm['name'].value_counts(dropna = False)

name
Alfred    2
batman    1
Name: count, dtype: int64

In [9]:
df = pd.DataFrame({
"number":[2,3,4,],
    "num":[5,3,4]
})

In [10]:
df.head()

   number  num
0       2    5
1       3    3
2       4    4

In [11]:
df.describe()

       number  num
count     3.0  3.0
mean      3.0  4.0
std       1.0  1.0
min       2.0  3.0
25%       2.5  3.5
50%       3.0  4.0
75%       3.5  4.5
max       4.0  5.0

In [12]:
df.mean()

number    3.0
num       4.0
dtype: float64

In [13]:
df.std()

number    1.0
num       1.0
dtype: float64

In [14]:
df.min()

number    2
num       3
dtype: int64

In [15]:
df.corr()

        number  num
number     1.0 -0.5
num       -0.5  1.0

In [16]:
df.count()

number    3
num       3
dtype: int64

In [17]:
df.max()

number    4
num       5
dtype: int64

In [18]:
df.median()

number    3.0
num       4.0
dtype: float64

In [23]:
data = pd.read_excel('data.xlsx')

In [24]:
data.head()

   Train No.  Speed        City
0      12792     23      rampur
1      12342    343     kolkata
2      23442     43     barelly
3      34323    433  antarctica

In [26]:
data = pd.read_excel('data.xlsx', sheet_name = 'sheet2')

In [29]:
data.head()

   Train No.  Speed        City
0        299     33      rampur
1       2323    343     kolkata
2       4343     34     barelly
3      34334    433  antarctica

In [28]:
data.iloc[0,0] = 299

In [30]:
data.to_excel('data.xlsx', sheet_name = 'Sheet2')